Repository: pypi-data/pypi-mirror-114
Catalog: packages/senaite.core/senaite.core-1.3.5.zip/senaite.core-1.3.5/bika/lims/locales/*/LC_MESSAGES/plone.po
Languages: bs, fa

source: AR Template
bs: AR šablon
fa: قالب AR

source: AR Templates
bs: AR šabloni
fa: قالب‌های AR

source: ARReport
bs: AR izvještaj
fa: گزارش AR

source: Activate
bs: Aktiviraj
fa: فعال شده

source: Active
bs: Aktivno
fa: فعال

source: Add Analyses
bs: Dodaj analizu
fa: اضافه کردن آزمایش

source: Add Blank Reference
bs: Dodaj praznu referencu
fa: اضافه کردن منبع شاهد

source: Add Control Reference
bs: Dodaj kontrolnu referencu
fa: اضافه کردن منبع کنترلی

source: Add Duplicate
bs: Dodaj duplikat
fa: اضافه کردن کپی

source: Administration
bs: Administracija
fa: ادمین

source: Analyses
bs: Analize
fa: آزمایش‌ها

source: Analysis
bs: Analiza
fa: آزمایش

source: Analysis Categories
bs: Kategorije analiza
fa: دسته‌بندی‌های آزمایش

source: Analysis Category
bs: Kategorija analize
fa: دسته‌بندی‌ آزمایش

source: Analysis Profile
bs: Profil analize
fa: پروفایل آزمایش

source: Analysis Profiles
bs: Profili analiza
fa: پروفایل‌های آزمایش

source: Analysis Service
bs: Analiza
fa: خدمات آزمایش

source: Analysis Services
bs: Analize
fa: خدمات آزمایش

source: Analysis Specification
bs: Specifikacija analize
fa: مشخصه آزمایش

source: Analysis Specifications
bs: Specifikacije analiza
fa: مشخصات آزمایش

source: Assign
bs: Dodijeli
fa: تخصیص دادن

source: Assigned
bs: Dodijeljeno
fa: تخصیص داده شده

source: Attach
bs: Ddaj
fa: پیوست

source: Attachment
bs: Dodatak
fa: فایل پیوست

source: Attachment Type
bs: Vrsta dodatka
fa: نوع پیوست

source: Attachment Types
bs: Vrste dodataka
fa: انواع پیوست

source: Attachment due
fa: سررسید پیوست

source: Attachments
bs: Dodaci
fa: پیوست‌ها

source: Audit Log
bs: Log provjere
fa: گزارش حسابرسی

source: Auto-Import Logs
bs: Auto-uvezi logove
fa: درونریزی خودکار گزارش‌ها

source: Batch
bs: Serija
fa: دسته‌بندی

source: Batch Book
bs: Knjiga serije
fa: دفترچه دسته‌بندی

source: Batch Label
bs: Oznaka serije
fa: برچسب دسته‌بندی

source: Batch Labels
bs: Naljepnice serije
fa: برچسب‌های دسته‌بندی

source: Batches
bs: Serije
fa: دسته‌بندی‌ها

source: Calculation
bs: Kalkulacija
fa: محاسبه

source: Calculations
bs: Kalkulacije
fa: محاسبات

source: Calibration Certificates
bs: Certifikati kalibracija
fa: تائیدیه کالیبراسون

source: Calibrations
bs: Kalibracije
fa: کالیبراسیون‌ها

source: Cancel
bs: Otkaži
fa: لغو

source: Client
bs: Klijent
fa: مشتری

source: Clients
bs: Klijenti
fa: مشتری‌ها

source: Close
bs: Zatvori
fa: بستن

source: Complete
bs: Završeno
fa: تمام شده

source: Contact
bs: Kontakt
fa: مخاطب

source: Contacts
bs: Kontakti
fa: مخاطبین

source: Container
bs: Kontejner
fa: نگه‌دارنده

source: Container Type
bs: Vrsta kontejnera
fa: نوع نگهدارنده

source: Container Types
bs: Vrste kontejnera
fa: انواع نگهدارنده

source: Containers
bs: Kontejneri
fa: نگهدارنده‌ها

source: Create Invoice PDF
bs: Kreiraj PDF račun
fa: ساخت PDF فاکتور

source: Current
bs: Trenutno
fa: کنونی

source: Dashboard
fa: میزکار

source: Deactivate
bs: Deaktiviraj
fa: غیرفعال

source: Department
bs: Odjeljenje
fa: دپارتمان

source: Departments
bs: Odjeljenja
fa: دپارتمان‌ها

source: Dispatch
bs: Pošalji
fa: ارسال

source: Dispatched
bs: Poslano
fa: ارسال شده

source: Dispose
fa: انتقال

source: Disposed
fa: منتقل شده

source: Documents
bs: Dokumenti
fa: اسناد

source: Dormant
fa: خوابیده

source: Duplicate Analysis
fa: آزمایش تکراری

source: Dynamic Analysis Specifications
bs: Dinamička specifikacija analiza
fa: مشخصات آزمایش پویا

source: Edit
bs: Izmjeni
fa: ویرایش

source: Expire
bs: Ističe
fa: انقضا

source: Expired
bs: Isteklo
fa: منقضی شده

source: Export
bs: Izvezi
fa: برون‌ریزی

source: History
bs: Istorija
fa: تاریخچه

source: Import
bs: Uvezi
fa: درون‌ریزی

source: Imported
bs: Uvezeno
fa: درون‌ریزی شده

source: Inactive
bs: Neaktivno
fa: غیر فعال

source: Instrument
fa: دستگاه

source: Instrument Locations
bs: Lokacije instrumenata
fa: موقعیت دستگاه‌ها

source: Instrument Type
bs: Vrsta instrumenta
fa: نوع دستگاه

source: Instrument Types
bs: Vrste instrumenata
fa: انواع دستگاه

source: Instruments
bs: Instrumenti
fa: دستگاه‌ها

source: Invalid
bs: Odbačeno
fa: نامعتبر

source: Invalidate
bs: Odbaci
fa: بی اعتبار کردن

source: Invoice
bs: Račun
fa: فاکتور

source: Lab Contact
bs: Kontakt laboratorije
fa: تماس با آزمایشگاه

source: Lab Contacts
bs: Kontakti laboratorije
fa: تماس‌های آزمایشگاه

source: Lab Departments
bs: Odjeljenja laboratorije
fa: دپارتمان‌های آزمایشگاه

source: Lab Products
bs: Proizvodi laboratorije
fa: محصولات آزمایشگاه

source: Laboratory
bs: Laboratorija
fa: آزمایشگاه

source: Laboratory Information
bs: Informacije o laboratoriji
fa: اطلاعات آزمایشگاه

source: Large Sticker
bs: Velika naljepnica
fa: برچسب بزرگ

source: Login details
bs: Detalji za login
fa: اطلاعات ورود

source: Maintenance
bs: Održavanje
fa: تعمیرات

source: Manage Analyses
bs: Upravljanje analizama
fa: مدیریت آزمایش‌ها

source: Manage Results
bs: Upravljanje rezultatima
fa: مدیریت نتایج

source: Manufacturer
bs: Proizvođač
fa: تولید کننده

source: Manufacturers
bs: Proizvođači
fa: تولید کننده‌ها

source: Method
bs: Metod
fa: روش

source: Methods
bs: Metode
fa: روش‌ها

source: My organization
bs: Moja organizacija
fa: سازمان من

source: No preservation required
fa: نگهداری نیاز ندارد

source: No sampling workflow
fa: نیاز به نمونه برداری ندارد

source: Not requested
fa: درخواست ندارد

source: Open
bs: Otvori
fa: باز

source: Orders
bs: Narudžbe
fa: سفارش‌ها

source: Pending
bs: Na čekanju
fa: در انتظار

source: Prepublish
bs: Priprema za objavu
fa: پیش انتشار

source: Preservation
bs: Čuvanje
fa: نگهداری

source: Preservation required
bs: Čuvanje neophodno
fa: نیاز به نگهداری

source: Preservations
bs: Sačuvano
fa: نگهداری‌ها

source: Preserve
bs: Sačuvaj
fa: نگه‌داری

source: Pricelist
bs: Cjenovnik
fa: لیست قیمت

source: Pricelists
bs: Cjenovnici
fa: لیست‌های قیمت

source: Print
bs: Štampaj
fa: پرینت

source: Print Invoice
bs: Štampaj račun
fa: چاپ فاکتور

source: Print pricelist
bs: Štampaj cjenovnik
fa: چاپ لیست قیمت

source: Productivity
bs: Produktivnost
fa: بهره‌وری

source: Publish
bs: Objavi
fa: انتشار

source: Published
bs: Objavljeno
fa: منتشر شده

source: Published results
bs: Objavljeni rezultati
fa: انتشار نتایج

source: QC Results
bs: QC rezultati
fa: نتایج کنترل کیفیت

source: Receive
bs: Prijem
fa: دریافت

source: Receive sample
bs: Prijem uzorka
fa: دریافت نمونه

source: Received
bs: Primljeno
fa: دریافت شده

source: Reference Analysis
bs: Referentne analize
fa: مرجع آزمایش

source: Reference Definition
bs: Definicija reference
fa: تعریف مرجع

source: Reference Definitions
bs: Definicije referenci
fa: تعاریف مرجع

source: Reference Sample
bs: Uzorak reference
fa: نمونه مرجع

source: Reference Samples
bs: Uzorci referenci
fa: نمونه‌های مرجع

source: Reference Values
bs: Referentne vrijednosti
fa: مقادیر مرجع

source: Reflex Rules
fa: قوانین واکنش

source: Reflex Rules Folder
fa: پوشه قوانین واکنش

source: ReflexRule
fa: قانون واکنش

source: Registered
fa: ثبت شده

source: Reinstate
fa: برگشت مجدد

source: Reject
bs: Odbaci
fa: رد کردن

source: Reject Analysis
bs: Odbaci analizu
fa: رد کردن آزمایش

source: Rejected
bs: Odbačeno
fa: رد شده

source: Remove
bs: Ukloni
fa: برداشتن

source: Report
bs: Izvještaj
fa: گزارش

source: Reports
bs: Izvještaji
fa: گزارش‌ها

source: Republish
bs: Ponovo objavi
fa: انتشار مجدد

source: Retract
bs: Povuci
fa: پس گرفتن

source: Retracted
bs: Povučeno
fa: پس گرفته شده

source: Sample
bs: Uzorak
fa: نمونه

source: Sample Condition
bs: Stanje uzorka
fa: وضعیت نمونه

source: Sample Conditions
bs: Stanja uzorka
fa: وضعیت‌های نمونه

source: Sample Imports
bs: Uvozi uzoraka
fa: درون‌ریزی نمونه

source: Sample Matrices
fa: ابعاد نمونه

source: Sample Matrix
fa: ماتریس نمونه

source: Sample Point
fa: نقطه نمونه

source: Sample Points
fa: نقاط نمونه

source: Sample Templates
fa: قالب‌های نمونه

source: Sample Type
bs: Vrsta uzorka
fa: نوع نمونه

source: Sample Types
bs: Vrste uzorka
fa: انواع نمونه

source: Sample due
bs: Uzorak se čeka
fa: سررسید نمونه

source: Sample received
bs: Uzorak primljen
fa: نمونه دریافت شد

source: Sample registered
bs: Uzorak registrovan
fa: نمونه ثبت شد

source: Sampled
bs: Uzorkovano
fa: نمونه برداری شد

source: Samples
bs: Uzorci
fa: نمونه‌ها

source: Sampling Deviation
fa: خطای نمونه برداری

source: Sampling Deviations
fa: خطاهای نمونه‌برداری

source: Sampling Round Templates
fa: قالب‌های رند نمونه برداری

source: Sampling workflow
fa: چریان نمونه برداری

source: Schedule
fa: برنامه

source: Schedule sampling
fa: برنامه نمونه برداری

source: Scheduled sampling
fa: نمونه برداری برنامه ریزی شده

source: Search
bs: Traži
fa: جستجو

source: Setup
fa: ستاپ

source: Sharing
fa: به اشتراک گزاری

source: Small Sticker
fa: برچسب کوچک

source: Sticker
fa: برچسب

source: Stickers preview
fa: پیشنمایش استیکر

source: Storage Location
fa: موقعیت انبار

source: Storage Locations
fa: موقعیت‌های انبار

source: Sub-group
fa: زیر گروه

source: Sub-groups
fa: زیر گروه‌ها

source: Submit
bs: Pošalji
fa: ثبت

source: Submit for verification
bs: Pošalji na verifikaciju
fa: ثبت جهت تایید

source: Supplier
bs: Dobavljač
fa: تامین کننده

source: Suppliers
bs: Dobavljač
fa: تامین کنندگان

source: Supply Order
fa: سفارش تامین

source: Supply Orders
fa: سفارش‌های تامین

source: To be preserved
bs: Za čuvanje
fa: نگهداری شود

source: To be sampled
bs: Za uzimanje uzorka
fa: نمونه برداری شود

source: To be verified
bs: Za verifikaciju
fa: تایید شود

source: Unpublished
bs: Povučeno iz objave
fa: منتشر نشده

source: Unsassign
fa: تخصیص داده نشده

source: Valid
bs: Validno
fa: معتبر

source: Validate
bs: Validiraj
fa: معتبر سازی

source: Validations
bs: Verifikacije
fa: اعتبار سنجی‌ها

source: Verified
bs: Verificirano
fa: تایید شده

source: Verify
bs: Verificiraj
fa: تایید

source: View
bs: Pregled
fa: مشاهده

source: Worksheet
fa: کاربرگ

source: Worksheet Template
fa: قالب‌ کاربرگ

source: Worksheet Templates
fa: قالب‌های کاربرگ

source: Worksheets
fa: قالب‌های کاربرگ‌ها

source: label_schema_Accounting
fa: حسابداری

source: label_schema_Address
fa: آدرس

source: label_schema_Analyses
fa: آزمایش‌ها

source: label_schema_Analysis Templates
fa: قالب‌های label_schema_Analysis

source: label_schema_Bank details
fa: اطلاعات بانک

source: label_schema_Calculation
fa: محاسبات

source: label_schema_Container and Preservation
fa: نگهداری و نگهدارنده‌ها

source: label_schema_Dates
fa: تاریخ‌ها

source: label_schema_Description
fa: شرح

source: label_schema_Email Telephone Fax
fa: ایمیل تلفن فکس

source: label_schema_ID Server
fa: ID Server

source: label_schema_Labels
fa: Labels

source: label_schema_Layout
fa: Layout

source: label_schema_Location
fa: Location

source: label_schema_Method
fa: Method

source: label_schema_Preferences
fa: Preferences

source: label_schema_Publication preference
fa: Publication preference

source: label_schema_Reference Values
fa: Reference Values

source: label_schema_Reflex Rule Folder
fa: پوشه قوانین label_schema_Reflex

source: label_schema_Result Options
fa: Result Options

source: label_schema_Results Reports
fa: Results Reports

source: label_schema_SR Templates
fa: SR Templates

source: label_schema_Sample Partitions
fa: Sample Partitions

source: label_schema_Sample Templates
fa: قالب‌های label_schema_Sample

source: label_schema_Security
fa: Security

source: label_schema_Uncertainties
fa: Uncertainties
