Repository: pypi-data/pypi-mirror-114
Catalog: packages/ceilometer/ceilometer-14.1.0.tar.gz/ceilometer-14.1.0/ceilometer/locale/*/LC_MESSAGES/ceilometer.po
Languages: id

source: Could not connect to XenAPI: %s
id: Tidak dapat terhubung ke XenAPI: %s

source: Could not get VM %s CPU number
id: Tidak bisa mendapatkan nomor CPU VM %s

source: Could not load the following pipelines: %s
id: Tidak dapat memuat pipelines berikut: %s

source: Error from libvirt while looking up instance <name=%(name)s, id=%(id)s>: [Error Code %(error_code)s] %(ex)s
id: Kesalahan dari libvirt saat melihat ke atas instance <name=%(name)s, id=%(id)s>: [Error Code %(error_code)s] %(ex)s

source: Failed to inspect data of instance <name=%(name)s, id=%(id)s>, domain state is SHUTOFF.
id: Gagal memeriksa data instance <name=%(name)s, id=%(id)s>, status domain adalah SHUTOFF.

source: Failed to inspect instance %(instance_uuid)s stats, can not get info from libvirt: %(error)s
id: Gagal memeriksa statistik instance %(instance_uuid)s, tidak dapat memperoleh info dari libvirt: %(error)s

source: Failed to publish %d datapoints, dropping them
id: Gagal mempublikasikan %d datapoints, menjatuhkannya

source: Failed to publish %d datapoints, queue them
id: Gagal mempublikasikan %d datapoints, antri mereka

source: Invalid YAML syntax in Definitions file %(file)s at line: %(line)s, column: %(column)s.
id: Sintaks YAML tidak valid di file Definisi %(file)s di line: %(line)s, column: %(column)s.

source: Invalid trait type '%(type)s' for trait %(trait)s
id: Invalid trait type '%(type)s' untuk trait %(trait)s

source: Invalid type %s specified
id: Jenis %s ditentukan tidak valid

source: Missing field %s
id: Field tidak ada %s

source: Multiple VM %s found in XenServer
id: Beberapa VM %s ditemukan di XenServer

source: Must specify connection_url, and connection_password to use
id: Harus menentukan connection_url, dan connection_password untuk digunakan

source: No plugin named %(plugin)s available for %(name)s
id: Tidak ada plugin bernama %(plugin)s yang tersedia untuk %(name)s

source: Node Manager init failed
id: Init Node Manager gagal

source: OpenDaylight API returned %(status)s %(reason)s
id: OpenDaylight API mengembalikan %(status)s %(reason)s

source: Opencontrail API returned %(status)s %(reason)s
id: Opencontrail API mengembalikan %(status)s %(reason)s

source: Parse error in JSONPath specification '%(jsonpath)s' for %(name)s: %(err)s
id: Kesalahan parsing dalam spesifikasi JSONPath '%(jsonpath)s' untuk %(name)s: %(err)ss

source: Plugin specified, but no plugin name supplied for %s
id: Plugin ditentukan, tetapi tidak ada nama plugin yang disediakan untuk %s

source: Polling %(mtr)s sensor failed for %(cnt)s times!
id: Sensor polling %(mtr)s gagal untuk %(cnt)s times!

source: Polling %(name)s failed for %(cnt)s times!
id: Polling %(name)s gagal untuk %(cnt)s times!

source: Pollster for %s is disabled!
id: Pollster untuk %s dinonaktifkan!

source: Publisher max local_queue length is exceeded, dropping %d oldest samples
id: Panjang max local_queue penerbit terlampaui, menjatuhkan %d sampel tertua

source: Publishing policy is unknown (%s) force to default
id: Kebijakan penerbitan tidak diketahui (%s) dipaksa ke default

source: RGW AdminOps API returned %(status)s %(reason)s
id: RGW AdminOps API mengembalikan %(status)s %(reason)s

source: Required field %(field)s should be a %(type)s
id: Field wajib %(field)s harus berupa %(type)s

source: Required field %s not specified
id: Bidang wajib %s tidak ditentukan

source: Required fields %s not specified
id: Fields wajib %s tidak ditentukan

source: The field 'fields' is required for %s
id: Bidang 'fields' diperlukan untuk %s

source: Unable to send sample over UDP
id: Tidak dapat mengirim sampel melalui UDP

source: Unknown status %(stat)s received on Load Balancer %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima pada Load Balancer %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on fw %(id)s,skipping sample
id: Status tidak diketahui %(stat)s diterima pada fw %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on listener %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima pada listener %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on member %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima pada member %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on pool %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima di pool %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on vip %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima pada vip %(id)s, melewatkan sampel

source: Unknown status %(stat)s received on vpn %(id)s, skipping sample
id: Status tidak diketahui %(stat)s diterima pada vpn %(id)s, melewatkan sampel

source: Unrecognized type value %s
id: Nilai jenis tidak dikenal %s

source: VM %s is poweredOff in VMware vSphere
id: VM %s poweredOff di VMware vSphere

source: VM %s not found in VMware vSphere
id: VM %s tidak ditemukan di VMware vSphere

source: VM %s not found in XenServer
id: VM %s tidak ditemukan di XenServer

source: Wrong sensor type
id: Jenis sensor salah

source: YAML error reading Definitions file %(file)s
id: Kesalahan YAML membaca file Definisi %(file)s

source: ipmitool output length mismatch
id: panjang keluaran ipmitool tidak cocok

source: monasca_client: using %s as Monasca endpoint
id: monasca_client: menggunakan %s sebagai endpoint Monasca

source: parse IPMI sensor data failed,No data retrieved from given input
id: parse data sensor IPMI gagal, Tidak ada data yang diambil dari input yang diberikan

source: parse IPMI sensor data failed,unknown sensor type
id: parse data sensor IPMI gagal, tipe sensor tidak dikenal

source: running ipmitool failure
id: menjalankan kegagalan ipmitool
