"""Heard the story of Dokdo.

독도와 이야기를 나누어 보세요.

Example:
    ``dokdo`` 사용법은 아래와 같습니다.

        $ pip install dokdo
        $ dokdo-ping

Todo:
    * 영어버전
    * 생태정보

"""
import random


def ping():
    """독도 이야기를 담은 노래를 불러 드립니다.

    Returns:
        1절 ~ 4절 중 하나를 불러드립니다.

    """
    lyrics = [
        "울릉도 동남쪽 뱃길 따라 87K 외로운 섬 하나 새들의 고향 그 누가 아무리 자기네 땅이라고 우겨도 독도는 우리땅",
        "경상북도 울릉군 울릉읍 독도리 동경 131 북위 37 평균 기온 13도 강수량은 1800 독도는 우리땅",
        "오징어 꼴뚜기 대구 홍합 따개비 주민등록 최종덕 이장 김성도",
        "지증왕 13년 섬나라 우산국 세종실록지리지 강원도 울진현 하와이는 미국 땅 대마도는 조선 땅 독도는 우리땅",
        "러일전쟁 직후에 임자 없는 섬이라고 억지로 우기면 정말 곤란해 신라장군 이사부 지하에서 웃는다 독도는 우리땅"
    ]
    return random.choice(lyrics)
