import enum


class UserStatus(enum.IntEnum):
    DEMO = 0        # DEMO учётка, которую пользователь сам зарегистрировал для знакомства с системой
    TRIAL = 1       # TRIAL учётка, которую выдали для углублённого тестирования системы
    PAYED = 2       # PAYED учётка, которую пользователь уже оплатил
    BLOCKED = 3     # BLOCKED учётка, которую временно заблокировали (не оплачен или нарушение правил)
    DELETED = 4     # DELETED учётка, которую удалили без возможности восстановления
